package chapter3;

public class Documentation {

    // Semaphore. Счетчик, который контролирует доступ к общему ресурсу.
    // Базовая реализация многопоточности, представленная во многих языках
    // CountDownLatch. Нужен для ожидания завершения пачки потоков.
    // CyclicBarrier. Синхронизация нескольких потоков в одной точке.
    // Phaser. Для выполнения нескольких многопочных задач, разделенных на фазы.
    // Exchanger. Представляет механизм обмена данными между несколькими потоками.
    // CompletableFuture. Механизм, когда один или несколько потоков ждут асинхронного выполнения задачи.

}
